Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 256, 256, 1) 0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 256, 256, 16) 160         input_1[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256, 256, 16) 0           conv2d[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 256, 16) 2320        dropout[0][0]
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 128, 16) 0           conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 32) 4640        max_pooling2d[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128, 128, 32) 0           conv2d_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 128, 32) 9248        dropout_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 64, 32)   0           conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 64, 64)   18496       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 64, 64, 64)   0           conv2d_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 64, 64)   36928       dropout_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 64)   0           conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 128)  73856       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 32, 32, 128)  0           conv2d_6[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 128)  147584      dropout_3[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 128)  0           conv2d_7[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 256)  295168      max_pooling2d_3[0][0]
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 16, 16, 256)  0           conv2d_8[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 256)  590080      dropout_4[0][0]
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 32, 32, 128)  131200      conv2d_9[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 32, 32, 256)  0           conv2d_transpose[0][0]
                                                                 conv2d_7[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 128)  295040      concatenate[0][0]
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 32, 32, 128)  0           conv2d_10[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 128)  147584      dropout_5[0][0]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 64, 64, 64)   32832       conv2d_11[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 64, 128)  0           conv2d_transpose_1[0][0]
                                                                 conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 64, 64, 64)   73792       concatenate_1[0][0]
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 64, 64, 64)   0           conv2d_12[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 64, 64, 64)   36928       dropout_6[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 128, 128, 32) 8224        conv2d_13[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128, 64) 0           conv2d_transpose_2[0][0]
                                                                 conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 128, 128, 32) 18464       concatenate_2[0][0]
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 128, 128, 32) 0           conv2d_14[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 128, 128, 32) 9248        dropout_7[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 256, 256, 16) 2064        conv2d_15[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 256, 32) 0           conv2d_transpose_3[0][0]
                                                                 conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 256, 256, 16) 4624        concatenate_3[0][0]
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 256, 256, 16) 0           conv2d_16[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 256, 256, 16) 2320        dropout_8[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 256, 256, 1)  17          conv2d_17[0][0]
==================================================================================================
Total params: 1,940,817
Trainable params: 1,940,817
Non-trainable params: 0
__________________________________________________________________________________________________
1
2
3
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            [(None, 256, 256, 1) 0
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 256, 256, 16) 160         input_2[0][0]
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 256, 256, 16) 0           conv2d_19[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 256, 256, 16) 2320        dropout_9[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 128, 128, 16) 0           conv2d_20[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 128, 128, 32) 4640        max_pooling2d_4[0][0]
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 128, 128, 32) 0           conv2d_21[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 128, 128, 32) 9248        dropout_10[0][0]
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 64, 64, 32)   0           conv2d_22[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 64, 64, 64)   18496       max_pooling2d_5[0][0]
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 64, 64, 64)   0           conv2d_23[0][0]
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 64, 64, 64)   36928       dropout_11[0][0]
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 32, 32, 64)   0           conv2d_24[0][0]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 32, 32, 128)  73856       max_pooling2d_6[0][0]
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 32, 32, 128)  0           conv2d_25[0][0]
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 32, 32, 128)  147584      dropout_12[0][0]
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 16, 16, 128)  0           conv2d_26[0][0]
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 16, 16, 256)  295168      max_pooling2d_7[0][0]
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 16, 16, 256)  0           conv2d_27[0][0]
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 16, 16, 256)  590080      dropout_13[0][0]
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 32, 32, 128)  131200      conv2d_28[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 32, 32, 256)  0           conv2d_transpose_4[0][0]
                                                                 conv2d_26[0][0]
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 32, 32, 128)  295040      concatenate_4[0][0]
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 32, 32, 128)  0           conv2d_29[0][0]
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 32, 32, 128)  147584      dropout_14[0][0]
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 64, 64, 64)   32832       conv2d_30[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 64, 64, 128)  0           conv2d_transpose_5[0][0]
                                                                 conv2d_24[0][0]
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 64, 64, 64)   73792       concatenate_5[0][0]
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 64, 64, 64)   0           conv2d_31[0][0]
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 64, 64, 64)   36928       dropout_15[0][0]
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 128, 128, 32) 8224        conv2d_32[0][0]
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 128, 128, 64) 0           conv2d_transpose_6[0][0]
                                                                 conv2d_22[0][0]
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 128, 128, 32) 18464       concatenate_6[0][0]
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 128, 128, 32) 0           conv2d_33[0][0]
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 128, 128, 32) 9248        dropout_16[0][0]
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 256, 256, 16) 2064        conv2d_34[0][0]
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 256, 256, 32) 0           conv2d_transpose_7[0][0]
                                                                 conv2d_20[0][0]
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 256, 256, 16) 4624        concatenate_7[0][0]
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 256, 256, 16) 0           conv2d_35[0][0]
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 256, 256, 16) 2320        dropout_17[0][0]
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 256, 256, 1)  17          conv2d_36[0][0]
==================================================================================================
Total params: 1,940,817
Trainable params: 1,940,817
Non-trainable params: 0
__________________________________________________________________________________________________
2021-04-09 20:15:45.706179: I tensorflow/compiler/mlir/mlir_graph_optimization_pass.cc:116] None of the MLIR optimization passes are enabled (registered 2)
Epoch 1/10
2/2 [==============================] - 14s 8s/step - loss: 0.9229 - jacard_coef: 0.0771 - val_loss: 0.9347 - val_jacard_coef: 0.0653
Epoch 2/10
2/2 [==============================] - 12s 7s/step - loss: 0.9210 - jacard_coef: 0.0790 - val_loss: 0.9332 - val_jacard_coef: 0.0668
Epoch 3/10
2/2 [==============================] - 12s 7s/step - loss: 0.9181 - jacard_coef: 0.0819 - val_loss: 0.9259 - val_jacard_coef: 0.0741
Epoch 4/10
2/2 [==============================] - 12s 6s/step - loss: 0.9085 - jacard_coef: 0.0915 - val_loss: 0.9263 - val_jacard_coef: 0.0737
Epoch 5/10
2/2 [==============================] - 12s 7s/step - loss: 0.9108 - jacard_coef: 0.0892 - val_loss: 0.9226 - val_jacard_coef: 0.0774
Epoch 6/10
2/2 [==============================] - 12s 7s/step - loss: 0.9032 - jacard_coef: 0.0968 - val_loss: 0.9219 - val_jacard_coef: 0.0781
Epoch 7/10
2/2 [==============================] - 12s 7s/step - loss: 0.9010 - jacard_coef: 0.0990 - val_loss: 0.9142 - val_jacard_coef: 0.0858
Epoch 8/10
2/2 [==============================] - 13s 7s/step - loss: 0.8960 - jacard_coef: 0.1040 - val_loss: 0.9101 - val_jacard_coef: 0.0899
Epoch 9/10
2/2 [==============================] - 14s 7s/step - loss: 0.8927 - jacard_coef: 0.1073 - val_loss: 0.9015 - val_jacard_coef: 0.0985
Epoch 10/10
2/2 [==============================] - 13s 7s/step - loss: 0.8828 - jacard_coef: 0.1172 - val_loss: 0.8931 - val_jacard_coef: 0.1069
Epoch 1/2
2/2 [==============================] - 15s 7s/step - loss: 0.7190 - accuracy: 0.1609 - val_loss: 0.6876 - val_accuracy: 0.7867
Epoch 2/2
2/2 [==============================] - 13s 7s/step - loss: 0.6738 - accuracy: 0.7815 - val_loss: 0.5593 - val_accuracy: 0.9279
1/1 [==============================] - 1s 982ms/step - loss: 0.8931 - jacard_coef: 0.1069
Accuracy of Jacard Model is =  10.685862600803375 %
1/1 [==============================] - 1s 986ms/step - loss: 0.5593 - accuracy: 0.9279
Accuracy of Standard Model is =  92.78503656387329 %