Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 160, 160, 1) 0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 160, 160, 16) 160         input_1[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 160, 160, 16) 0           conv2d[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 160, 160, 16) 2320        dropout[0][0]
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 80, 80, 16)   0           conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 80, 80, 32)   4640        max_pooling2d[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 80, 80, 32)   0           conv2d_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 80, 80, 32)   9248        dropout_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 40, 40, 32)   0           conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 40, 40, 64)   18496       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 40, 40, 64)   0           conv2d_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 40, 40, 64)   36928       dropout_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 20, 20, 64)   0           conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 20, 20, 128)  73856       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 20, 20, 128)  0           conv2d_6[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 20, 20, 128)  147584      dropout_3[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 10, 10, 128)  0           conv2d_7[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 10, 10, 256)  295168      max_pooling2d_3[0][0]
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 10, 10, 256)  0           conv2d_8[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 10, 10, 256)  590080      dropout_4[0][0]
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 20, 20, 128)  131200      conv2d_9[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 20, 20, 256)  0           conv2d_transpose[0][0]
                                                                 conv2d_7[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 20, 20, 128)  295040      concatenate[0][0]
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 20, 20, 128)  0           conv2d_10[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 20, 20, 128)  147584      dropout_5[0][0]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 40, 40, 64)   32832       conv2d_11[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 40, 40, 128)  0           conv2d_transpose_1[0][0]
                                                                 conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 40, 40, 64)   73792       concatenate_1[0][0]
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 40, 40, 64)   0           conv2d_12[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 40, 40, 64)   36928       dropout_6[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 80, 80, 32)   8224        conv2d_13[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 80, 80, 64)   0           conv2d_transpose_2[0][0]
                                                                 conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 80, 80, 32)   18464       concatenate_2[0][0]
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 80, 80, 32)   0           conv2d_14[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 80, 80, 32)   9248        dropout_7[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 160, 160, 16) 2064        conv2d_15[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 160, 160, 32) 0           conv2d_transpose_3[0][0]
                                                                 conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 160, 160, 16) 4624        concatenate_3[0][0]
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 160, 160, 16) 0           conv2d_16[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 160, 160, 16) 2320        dropout_8[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 160, 160, 1)  17          conv2d_17[0][0]
==================================================================================================
Total params: 1,940,817
Trainable params: 1,940,817
Non-trainable params: 0
__________________________________________________________________________________________________
2021-04-04 17:48:52.768115: I tensorflow/compiler/mlir/mlir_graph_optimization_pass.cc:116] None of the MLIR optimization passes are enabled (registered 2)
Epoch 1/10
37/37 [==============================] - 104s 3s/step - loss: 0.2018 - accuracy: 0.8337 - val_loss: 0.0031 - val_accuracy: 0.9728
Epoch 2/10
37/37 [==============================] - 115s 3s/step - loss: 0.0010 - accuracy: 0.9738 - val_loss: 0.0014 - val_accuracy: 0.9728
Epoch 3/10
37/37 [==============================] - 109s 3s/step - loss: 9.0281e-04 - accuracy: 0.9738 - val_loss: 0.0014 - val_accuracy: 0.9728
Epoch 4/10
37/37 [==============================] - 112s 3s/step - loss: 8.6606e-04 - accuracy: 0.9738 - val_loss: 0.0016 - val_accuracy: 0.9728
Epoch 5/10
37/37 [==============================] - 115s 3s/step - loss: 8.4809e-04 - accuracy: 0.9738 - val_loss: 0.0016 - val_accuracy: 0.9728
Epoch 6/10
37/37 [==============================] - 103s 3s/step - loss: 8.3496e-04 - accuracy: 0.9738 - val_loss: 0.0014 - val_accuracy: 0.9728
Epoch 7/10
37/37 [==============================] - 119s 3s/step - loss: 8.2510e-04 - accuracy: 0.9738 - val_loss: 0.0013 - val_accuracy: 0.9728
Epoch 8/10
37/37 [==============================] - 118s 3s/step - loss: 8.1623e-04 - accuracy: 0.9738 - val_loss: 0.0012 - val_accuracy: 0.9728
Epoch 9/10
37/37 [==============================] - 117s 3s/step - loss: 8.0937e-04 - accuracy: 0.9738 - val_loss: 0.0012 - val_accuracy: 0.9728
Epoch 10/10
37/37 [==============================] - 127s 3s/step - loss: 8.0457e-04 - accuracy: 0.9738 - val_loss: 0.0012 - val_accuracy: 0.9728
3/3 [==============================] - 3s 751ms/step - loss: 0.0012 - accuracy: 0.9728
Accuracy =  97.27506041526794 %
IoU socre is:  0.0
1
2
3
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            [(None, 160, 160, 1) 0
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 160, 160, 16) 160         input_2[0][0]
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 160, 160, 16) 0           conv2d_19[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 160, 160, 16) 2320        dropout_9[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 80, 80, 16)   0           conv2d_20[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 80, 80, 32)   4640        max_pooling2d_4[0][0]
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 80, 80, 32)   0           conv2d_21[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 80, 80, 32)   9248        dropout_10[0][0]
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 40, 40, 32)   0           conv2d_22[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 40, 40, 64)   18496       max_pooling2d_5[0][0]
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 40, 40, 64)   0           conv2d_23[0][0]
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 40, 40, 64)   36928       dropout_11[0][0]
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 20, 20, 64)   0           conv2d_24[0][0]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 20, 20, 128)  73856       max_pooling2d_6[0][0]
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 20, 20, 128)  0           conv2d_25[0][0]
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 20, 20, 128)  147584      dropout_12[0][0]
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 10, 10, 128)  0           conv2d_26[0][0]
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 10, 10, 256)  295168      max_pooling2d_7[0][0]
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 10, 10, 256)  0           conv2d_27[0][0]
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 10, 10, 256)  590080      dropout_13[0][0]
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 20, 20, 128)  131200      conv2d_28[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 20, 20, 256)  0           conv2d_transpose_4[0][0]
                                                                 conv2d_26[0][0]
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 20, 20, 128)  295040      concatenate_4[0][0]
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 20, 20, 128)  0           conv2d_29[0][0]
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 20, 20, 128)  147584      dropout_14[0][0]
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 40, 40, 64)   32832       conv2d_30[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 40, 40, 128)  0           conv2d_transpose_5[0][0]
                                                                 conv2d_24[0][0]
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 40, 40, 64)   73792       concatenate_5[0][0]
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 40, 40, 64)   0           conv2d_31[0][0]
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 40, 40, 64)   36928       dropout_15[0][0]
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 80, 80, 32)   8224        conv2d_32[0][0]
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 80, 80, 64)   0           conv2d_transpose_6[0][0]
                                                                 conv2d_22[0][0]
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 80, 80, 32)   18464       concatenate_6[0][0]
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 80, 80, 32)   0           conv2d_33[0][0]
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 80, 80, 32)   9248        dropout_16[0][0]
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 160, 160, 16) 2064        conv2d_34[0][0]
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 160, 160, 32) 0           conv2d_transpose_7[0][0]
                                                                 conv2d_20[0][0]
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 160, 160, 16) 4624        concatenate_7[0][0]
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 160, 160, 16) 0           conv2d_35[0][0]
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 160, 160, 16) 2320        dropout_17[0][0]
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 160, 160, 1)  17          conv2d_36[0][0]
==================================================================================================
Total params: 1,940,817
Trainable params: 1,940,817
Non-trainable params: 0
__________________________________________________________________________________________________